set_property IOSTANDARD LVCMOS33 [get_ports DA_CLK]
set_property PACKAGE_PIN M18 [get_ports DA_CLK]
set_property IOSTANDARD LVCMOS33 [get_ports DA_RESET]
set_property PACKAGE_PIN N15 [get_ports DA_RESET]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD1[9]}]
set_property PACKAGE_PIN V16 [get_ports {AD1[9]}]
set_property PACKAGE_PIN T16 [get_ports {AD1[8]}]
set_property PACKAGE_PIN V15 [get_ports {AD1[7]}]
set_property PACKAGE_PIN T15 [get_ports {AD1[6]}]
set_property PACKAGE_PIN T14 [get_ports {AD1[5]}]
set_property PACKAGE_PIN V13 [get_ports {AD1[4]}]
set_property PACKAGE_PIN V12 [get_ports {AD1[3]}]
set_property PACKAGE_PIN W13 [get_ports {AD1[2]}]
set_property PACKAGE_PIN Y14 [get_ports {AD1[1]}]
set_property PACKAGE_PIN W14 [get_ports {AD1[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AD2[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {DA_DATA[9]}]
set_property PACKAGE_PIN Y18 [get_ports {AD2[9]}]
set_property PACKAGE_PIN W18 [get_ports {AD2[8]}]
set_property PACKAGE_PIN Y19 [get_ports {AD2[7]}]
set_property PACKAGE_PIN W19 [get_ports {AD2[6]}]
set_property PACKAGE_PIN W20 [get_ports {AD2[5]}]
set_property PACKAGE_PIN V20 [get_ports {AD2[4]}]
set_property PACKAGE_PIN U20 [get_ports {AD2[3]}]
set_property PACKAGE_PIN T19 [get_ports {AD2[2]}]
set_property PACKAGE_PIN T20 [get_ports {AD2[1]}]
set_property PACKAGE_PIN R19 [get_ports {AD2[0]}]
set_property PACKAGE_PIN D19 [get_ports {DA_DATA[9]}]
set_property PACKAGE_PIN D20 [get_ports {DA_DATA[8]}]
set_property PACKAGE_PIN F20 [get_ports {DA_DATA[7]}]
set_property PACKAGE_PIN F19 [get_ports {DA_DATA[6]}]
set_property PACKAGE_PIN G20 [get_ports {DA_DATA[5]}]
set_property PACKAGE_PIN G19 [get_ports {DA_DATA[4]}]
set_property PACKAGE_PIN H20 [get_ports {DA_DATA[3]}]
set_property PACKAGE_PIN J20 [get_ports {DA_DATA[2]}]
set_property PACKAGE_PIN J19 [get_ports {DA_DATA[1]}]
set_property PACKAGE_PIN K19 [get_ports {DA_DATA[0]}]
set_property IOSTANDARD DIFF_HSTL_I [get_ports ADCLK_N]
set_property IOSTANDARD DIFF_HSTL_I [get_ports ADCLK_P]
set_property PACKAGE_PIN U18 [get_ports ADCLK_P]
set_property PACKAGE_PIN N16 [get_ports DA_SEL]
set_property PACKAGE_PIN M17 [get_ports DA_WRT]
set_property IOSTANDARD LVCMOS33 [get_ports DA_SEL]
set_property IOSTANDARD LVCMOS33 [get_ports DA_WRT]
create_clock -period 8.000 -name ADCLK_P -waveform {0.000 4.000} [get_ports ADCLK_P]
create_generated_clock -name DA_CLK -source [get_pins ZYNQ_System_i/AD9767_0/inst/ODDR_DAC_CLK/C] -divide_by 1 -invert [get_ports DA_CLK]
set_input_delay -clock [get_clocks ADCLK_P] -min -add_delay 3.000 [get_ports {AD1[*]}]
set_input_delay -clock [get_clocks ADCLK_P] -max -add_delay 5.000 [get_ports {AD1[*]}]
set_input_delay -clock [get_clocks ADCLK_P] -min -add_delay 3.000 [get_ports {AD2[*]}]
set_input_delay -clock [get_clocks ADCLK_P] -max -add_delay 5.000 [get_ports {AD2[*]}]
set_output_delay -clock [get_clocks ADCLK_P] -clock_fall -min -add_delay -1.500 [get_ports {DA_DATA[*]}]
set_output_delay -clock [get_clocks ADCLK_P] -clock_fall -max -add_delay 2.000 [get_ports {DA_DATA[*]}]
set_output_delay -clock [get_clocks ADCLK_P] -min -add_delay -1.500 [get_ports {DA_DATA[*]}]
set_output_delay -clock [get_clocks ADCLK_P] -max -add_delay 2.000 [get_ports {DA_DATA[*]}]
set_output_delay -clock [get_clocks ADCLK_P] -clock_fall -min -add_delay -1.500 [get_ports DA_SEL]
set_output_delay -clock [get_clocks ADCLK_P] -clock_fall -max -add_delay 2.000 [get_ports DA_SEL]
set_output_delay -clock [get_clocks ADCLK_P] -min -add_delay -1.500 [get_ports DA_SEL]
set_output_delay -clock [get_clocks ADCLK_P] -max -add_delay 2.000 [get_ports DA_SEL]
set_output_delay -clock [get_clocks DA_CLK] -min -add_delay -2.000 [get_ports DA_WRT]
set_output_delay -clock [get_clocks DA_CLK] -max -add_delay 1.500 [get_ports DA_WRT]
